Revit 2027 API
IPerformanceAdviserRule Interface
 Base class to derive specific performance adviser rules from.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IPerformanceAdviserRule
Public Interface IPerformanceAdviserRule
public interface class IPerformanceAdviserRule
type IPerformanceAdviserRule = interface end
The IPerformanceAdviserRule type exposes the following members.
Methods
Name | Description
ExecuteElementCheck |  Invoked by performance advisor for each element to be checked.
FinalizeCheck |  Invoked by performance advisor once in the end of the check.
GetDescription |  Retrieves the description of the rule.
GetElementFilter |  Retrieves a filter to restrict elements to be checked.
GetName |  Retrieves the name of the rule.
InitCheck |  Invoked by performance advisor once in the beginning of the check. If rule checks document as a whole, the check can be performed in this method.
WillCheckElements |  Reports if rule needs to be executed on individual elements.
Top
See Also
Reference
Autodesk.Revit.DB Namespace